novaeco/tribo-sim/sdkconfig.defaults
# =============================================================================
# ESP32-P4 + 4.3" 480x800 MIPI-DSI + GT911 Touch Panel
# Default configuration for ESP-IDF 6.1 + LVGL 9.4
# =============================================================================

# --- Target & Flash ---
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Chip Revision (v1.3) ---
# Your ESP32-P4 is revision v1.3, not v3.x
# ESP32-P4 revisions <3.0 and >=3.0 are mutually exclusive in ESP-IDF 6.x
# Must first select "less than v3" to enable rev 1.x options
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- Custom partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# --- Compiler Optimization ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y

# --- CPU Frequency (ESP32-P4 max 400MHz) ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y

# --- PSRAM (32MB) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Cache Configuration ---
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- System ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=3584

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# --- Task Watchdog (DISABLED to prevent crashes during heavy WiFi+BLE+LVGL operations) ---
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_TASK_WDT_EN=n

# --- FAT/VFS ---
CONFIG_FATFS_LFN_HEAP=y
CONFIG_VFS_MAX_COUNT=15

# --- LWIP ---
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4

# --- Experimental Features ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# =============================================================================
# LVGL 9.4 Configuration
# =============================================================================
# Note: LVGL 9.x removed many old config options. The following are valid for 9.4:

# IRAM optimization for fast memory access
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# Fonts - enable Montserrat fonts for demo UIs
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_30=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_42=y
CONFIG_LV_FONT_MONTSERRAT_44=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Demos
CONFIG_LV_USE_MONKEY=y
CONFIG_LV_USE_DEMO_WIDGETS=y
CONFIG_LV_USE_DEMO_BENCHMARK=y
CONFIG_LV_USE_DEMO_STRESS=y

# =============================================================================
# Application-Specific Configuration
# =============================================================================

# --- LCD Orientation (Landscape: 1024x600 for 7-inch panel) ---
CONFIG_APP_LCD_ORIENTATION_LANDSCAPE=y
CONFIG_APP_LVGL_ROTATION=0
CONFIG_APP_LCD_H_RES=1024
CONFIG_APP_LCD_V_RES=600

# --- Touch Controller (GT911) ---
CONFIG_APP_TOUCH_I2C_PORT=0
CONFIG_APP_TOUCH_I2C_SDA=22
CONFIG_APP_TOUCH_I2C_SCL=23
CONFIG_APP_TOUCH_I2C_ADDR=0x5D
CONFIG_APP_TOUCH_I2C_INT_GPIO=20
CONFIG_APP_TOUCH_I2C_RST_GPIO=21

# --- MIPI-DSI Configuration ---
CONFIG_APP_DSI_LANE_NUM=2
CONFIG_APP_DSI_LANE_BITRATE_MBPS=800

# =============================================================================
# ESP-Hosted Configuration (WiFi + Bluetooth via ESP32-C6 co-processor)
# =============================================================================
# ESP32-P4 has no integrated WiFi/Bluetooth - we use ESP32-C6 via esp_hosted
# Current C6 firmware: ESP-Hosted v2.8.5 (BLE only, no Bluetooth Classic)

# --- ESP-Hosted Transport ---
CONFIG_ESP_HOSTED_TRANSPORT_SDIO=y

# --- WiFi Configuration ---
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6

# --- Bluetooth Configuration ---
# BT Core config - Réactivé avec workaround -msmall-data-limit=0
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y

# BLE 5.0 Features - Now supported with ESP-Hosted 2.8.5
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# ESP-Hosted Bluetooth transport (VHCI over SDIO)
CONFIG_ESP_HOSTED_ENABLE_BT_BLUEDROID=y
CONFIG_ESP_HOSTED_BLUEDROID_HCI_VHCI=y

# BLE Advertising/Scan optimizations
CONFIG_BT_BLE_SCAN_DUPL=y
CONFIG_BT_LE_SCAN_DUPL_TYPE=0

# =============================================================================
# SÉCURITÉ - Conformité production
# =============================================================================

# NVS Encryption - Protège les credentials WiFi et données sensibles
# NOTE: Désactivé car nécessite configuration eFuse sur ESP32-P4
# Pour activer: configurer CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID dans menuconfig
# CONFIG_NVS_ENCRYPTION=y

# Task Watchdog - Protection contre les blocages
# Activé avec timeout généreux pour WiFi+BLE+LVGL
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y

# Flash Encryption & Secure Boot - À activer en PRODUCTION FINALE UNIQUEMENT
# ⚠️ ATTENTION: En mode Release, impossible de reflasher sans la clé !
# CONFIG_SECURE_FLASH_ENC_ENABLED=y
# CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
# CONFIG_SECURE_BOOT=y

